Cylopsis/Little-TempControled-Box/board/MCUX_Config/board/pin_mux.h
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);
#define PCR_IBE_ibe0 0x00u /*!<@brief Input Buffer Enable: Disables */
#define PCR_IBE_ibe1 0x01u           /*!<@brief Input Buffer Enable: Enables */
#define PCR_INV_inv0 0x00u           /*!<@brief Invert Input: Does not invert */
#define PCR_PE_pe0 0x00u           /*!<@brief Pull Enable: Disables */
#define PCR_PE_pe1 0x01u             /*!<@brief Pull Enable: Enables */
#define PCR_PS_ps1 0x01u             /*!<@brief Pull Select: Enables internal pullup resistor */
#define PORT2_PCR0_MUX_mux00 0x00u /*!<@brief Pin Multiplex Control: Alternative 0 (GPIO) */
#define PORT3_PCR16_MUX_mux111 0x07u /*!<@brief Pin Multiplex Control: Alternative 7 (chip-specific) */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
